In [1]:
import pandas as pd

# question 1 --
the five functions of pandas library used following are Dataframe , head() , tail() , mean() and groupby

In [2]:
data = {"Name" : ["Alice" , "Bob" , "Claire" , "Shivam" , "Mohit" , "arjun" , "priya"] ,
        "Age" : ["25" , "30" , "27", "20" , "23" , "19" , "26"],
        "Gender" : ["Female" , "male" , "female" , "male" , "male", "male" , "female"] }
df = pd.DataFrame(data  )
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    male
2  Claire  27  female
3  Shivam  20    male
4   Mohit  23    male
5   arjun  19    male
6   priya  26  female

In [3]:
df.head()

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    male
2  Claire  27  female
3  Shivam  20    male
4   Mohit  23    male

In [4]:
df.tail()

     Name Age  Gender
2  Claire  27  female
3  Shivam  20    male
4   Mohit  23    male
5   arjun  19    male
6   priya  26  female

In [5]:
df['Age'].mean()

3614674318846.5713

In [6]:
for i in df.groupby('Gender'):
    print(i)

('Female',     Name Age  Gender
0  Alice  25  Female)
('female',      Name Age  Gender
2  Claire  27  female
6   priya  26  female)
('male',      Name Age Gender
1     Bob  30   male
3  Shivam  20   male
4   Mohit  23   male
5   arjun  19   male)

# question 2

In [7]:
data = {"A" : ["Alice" , "Bob" , "Claire" , "Shivam" , "Mohit" , "arjun" , "priya"] ,
        "B" : ["25" , "30" , "27", "20" , "23" , "19" , "26"],
        "C" : ["Female" , "male" , "female" , "male" , "male", "male" , "female"] }
df = pd.DataFrame(data)

def reindexing(DataFrame):
    new_index = range(1, len(DataFrame)*2, 2)
    new_Dataframe = DataFrame.set_index(pd.Index(new_index))
    return new_Dataframe
    
reindexing(df)

         A   B       C
1    Alice  25  Female
3      Bob  30    male
5   Claire  27  female
7   Shivam  20    male
9    Mohit  23    male
11   arjun  19    male
13   priya  26  female

# question 3

In [11]:
data = {"Name" : ["Alice" , "Bob" , "Claire" , "Shivam" , "Mohit" , "arjun" , "priya"] ,
        "Values" : ["25" , "30" , "27", "20" , "23" , "19" , "26"],
        "Gender" : ["Female" , "male" , "female" , "male" , "male", "male" , "female"] }
df = pd.DataFrame(data)
df1 = df.head(3)
sum=0
for i in df1['Values']:  
    sum+=int(i)
print(sum)

82

# question 4

In [7]:
pd.set_option("display.max_colwidth" ,1000)
df3 = pd.DataFrame({"Text" :["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language." ,"my name is shivam", "i am a data science student"]})
df3["Word_Count"] = df3["Text"].apply(len)
df3

,Text,Word_Count
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,my name is shivam,17
2,i am a data science student,27

# question 5
Syntax: dataframe.size
Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Syntax: dataframe.shape
Return : Returns tuple of shape (Rows, columns) of dataframe/series

# question 6

read_excel() function is used to read an excel file in pandas

# question 7

In [5]:
data = {"Name" : ["Alice" , "Bob" , "Claire" , "Shivam" , "Mohit" , "arjun" , "priya"] ,
        "Values" : ["25" , "30" , "27", "20" , "23" , "19" , "26"],
        "Gender" : ["Female" , "male" , "female" , "male" , "male", "male" , "female"],
       "Email" : ["alice@domain.com" , "Bob.doe@domain.com" , "Claire_perry@domain.com" , "Shivam.gupta@domain.com" , "Mohit@domain.com" , "arj1un@domain.com" , "priya123@domain.com"]}

In [6]:
df = pd.DataFrame(data)

In [33]:
df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])

df

# question 8

In [25]:
data = {"A" : [3,8,6,2,9] , "B" :[5,2,9,3,1] , "C" : [1,7,4,5,2]}
df = pd.DataFrame(data)
df1 = df[(df['A'] > 5) & (df['B']<10)]
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# question 9

In [37]:
data = {"Name" : ["Alice" , "Bob" , "Claire" , "Shivam" , "Mohit" , "arjun" , "priya"] ,
        "Values" : [25 , 30 , 27, 20 , 23 , 19 , 26],
        "Gender" : ["Female" , "male" , "female" , "male" , "male", "male" , "female"] }
df = pd.DataFrame(data)

In [38]:
df['Values'].mean()

24.285714285714285

In [39]:
df['Values'].median()

25.0

In [40]:
df['Values'].std()

3.903600291794133

# question 10

In [4]:
data = {"Sales" : [507 , 605 , 403 , 923 , 777 , 456 , 789 , 345, 888 , 678] , "Date" : ['2023-06-22' , '2023-06-23', '2023-06-24' , '2023-06-25', '2023-06-26', '2023-06-27' , '2023-06-28' , '2023-06-29', '2023-06-30' , '2023-06-22']}

In [7]:
df = pd.DataFrame(data)
df

   Sales        Date
0    507  2023-06-22
1    605  2023-06-23
2    403  2023-06-24
3    923  2023-06-25
4    777  2023-06-26
5    456  2023-06-27
6    789  2023-06-28
7    345  2023-06-29
8    888  2023-06-30
9    678  2023-06-22

In [9]:
df['Moving average'] = df['Sales'].rolling(window = 7).mean()

In [10]:
df

   Sales        Date  Moving average
0    507  2023-06-22             NaN
1    605  2023-06-23             NaN
2    403  2023-06-24             NaN
3    923  2023-06-25             NaN
4    777  2023-06-26             NaN
5    456  2023-06-27             NaN
6    789  2023-06-28      637.142857
7    345  2023-06-29      614.000000
8    888  2023-06-30      654.428571
9    678  2023-06-22      693.714286

# question 11

In [12]:
data = {"Date" : ['2023-03-01' , '2023-03-02' , '2023-03-03' , '2023-03-04' , '2023-03-05' , '2023-03-06',  '2023-03-07' , '2023-03-08']}

In [13]:
df = pd.DataFrame(data)
df

         Date
0  2023-03-01
1  2023-03-02
2  2023-03-03
3  2023-03-04
4  2023-03-05
5  2023-03-06
6  2023-03-07
7  2023-03-08

In [15]:
df['Date'] = pd.to_datetime(df['Date'])
df['Weekday'] = df['Date'].dt.day_name()

In [16]:
df

        Date    Weekday
0 2023-03-01  Wednesday
1 2023-03-02   Thursday
2 2023-03-03     Friday
3 2023-03-04   Saturday
4 2023-03-05     Sunday
5 2023-03-06     Monday
6 2023-03-07    Tuesday
7 2023-03-08  Wednesday

# question 12

In [23]:
df=pd.DataFrame(data=['2023-01-02 09:15:00','2023-03-02 15:25:02','2023-03-02 15:45:00','2023-01-02 05:55:00','2023-03-02 05:55:00'],columns=['Date'])
df

                  Date
0  2023-01-02 09:15:00
1  2023-03-02 15:25:02
2  2023-03-02 15:45:00
3  2023-01-02 05:55:00
4  2023-03-02 05:55:00

In [24]:
import pandas as pd
from datetime import datetime

def filter_dates(df, start_date, end_date):
    date_format = '%Y-%m-%d %H:%M:%S'
    start_date_str = start_date.strftime(date_format)
    end_date_str = end_date.strftime(date_format)
    filtered_df = df.loc[(df['Date'] >= start_date_str) & (df['Date'] <= end_date_str)]
    return filtered_df

start_date = datetime(2023, 1, 1, 0, 0, 0)
end_date = datetime(2023, 1, 31, 0, 0, 0)

filtered_df = filter_dates(df, start_date, end_date)
print(filtered_df)

                  Date
0  2023-01-02 09:15:00
3  2023-01-02 05:55:00

# question 13

To use the basic functions of pandas, the first and foremost library to be imported is pandas itself.

syntax -- import pandas as pd